## Consultas SQL

### Conectar a la base de datos SQLite

In [3]:
import sqlite3
import pandas as pd

# Ruta ABSOLUTA a la base de datos
ruta_db = r"C:\repos\Grupo1_Demanda_Transporte_Publico\data\db\demanda_transporte.db"

conn = sqlite3.connect(ruta_db)
print("Conectado a la base de datos:", ruta_db)

Conectado a la base de datos: C:\repos\Grupo1_Demanda_Transporte_Publico\data\db\demanda_transporte.db

## Ver todas las tablas de la base de datos

In [4]:
pd.read_sql_query("SELECT name FROM sqlite_master WHERE type='table';", conn)

                name
0          pasajeros
1         passajeros
2  pasajeros_cartago

## Mostrar estructura de la tabla pasajeros_cartago

In [5]:
pd.read_sql_query("PRAGMA table_info(pasajeros_cartago);", conn)

   cid                  name     type  notnull dflt_value  pk
0    0                    id  INTEGER        0       None   1
1    1                  year  INTEGER        0       None   0
2    2                 month  INTEGER        0       None   0
3    3                nombre     TEXT        0       None   0
4    4            codigoruta     TEXT        0       None   0
5    5            nombreruta     TEXT        0       None   0
6    6  pasajerosadultomayor  INTEGER        0       None   0
7    7    pasajerosregulares  INTEGER        0       None   0
8    8      pasajerostotales  INTEGER        0       None   0

## Cantidad total de pasajeros por año (Cartago)

In [6]:
pd.read_sql_query("""
SELECT
    year,
    SUM(pasajerostotales) AS total_pasajeros
FROM pasajeros_cartago
GROUP BY year
ORDER BY year;
""", conn)

   year  total_pasajeros
0  2021         25819348
1  2022         31361347
2  2023         32969350

## Top 10 rutas con más pasajeros en Cartago

In [7]:
pd.read_sql_query("""
SELECT
    codigoruta,
    nombreruta,
    SUM(pasajerostotales) AS total_pasajeros
FROM pasajeros_cartago
GROUP BY codigoruta, nombreruta
ORDER BY total_pasajeros DESC
LIMIT 10;
""", conn)

,codigoruta,nombreruta,total_pasajeros
0,300,SAN JOSE-CARTAGO Y VICEVERSA,20450853
1,336,CARTAGO-PARAISO Y EXTENSIONES - CACHI-LOAIZA-P...,11739500
2,335,CARTAGO-AGUA CALIENTE-LOURDES-MATA DE GUINEO-U...,7089140
3,328,CARTAGO – TEJAR – SAN ISIDRO – HIGUITO – PARQU...,6692218
4,326,CARTAGO-TRES RIOS Y VICEVERSA,5885029
5,307,CARTAGO-COT-SAN JOSE –VOLCAN IRAZU-CARTAGO-TIE...,4741624
6,339,CARTAGO-OROSI-PALOMO-RIO MACHO-LA ALEGRIA-PURI...,3759612
7,323,CARTAGO-TARAS-SAN NICOLAS-LA LIMA-OCHOMOGO,3634298
8,331,CARTAGO-TABLON-TOBOSI-QUEBRADILLAS-BARRANCAS-C...,3412274
9,325,CARTAGO-SAN RAFAEL DE OREAMUNO-MARIA AUXILIADO...,2624426

## Tendencia mensual de pasajeros en Cartago (año por año)

In [8]:
pd.read_sql_query("""
SELECT
    year,
    month,
    SUM(pasajerostotales) AS total_pasajeros
FROM pasajeros_cartago
GROUP BY year, month
ORDER BY year, month;
""", conn)

    year  month  total_pasajeros
0   2021      1          2070527
1   2021      2          1987866
2   2021      3          2155577
3   2021      4          1978824
4   2021      5          1946738
5   2021      6          2053252
6   2021      7          2152077
7   2021      8          2191707
8   2021      9          2196023
9   2021     10          2326851
10  2021     11          2315267
11  2021     12          2444639
12  2022      1          2409239
13  2022      2          2390871
14  2022      3          2669747
15  2022      4          2437051
16  2022      5          2622453
17  2022      6          2592136
18  2022      7          2623317
19  2022      8          2697881
20  2022      9          2643379
21  2022     10          2759871
22  2022     11          2721850
23  2022     12          2793552
24  2023      1          2718503
25  2023      2          2655115
26  2023      3          2810903
27  2023      4          2575005
28  2023      5          2807791
29  2023      6          2732304
30  2023      7          2747732
31  2023      8          2814026
32  2023      9          2790611
33  2023     10          2822055
34  2023     11          2753617
35  2023     12          2741688

## Buscar todas las rutas que contienen la palabra “Cartago”

In [9]:
pd.read_sql_query("""
SELECT *
FROM pasajeros_cartago
WHERE LOWER(nombreruta) LIKE '%cartago%';
""", conn)

,id,year,month,nombre,codigoruta,nombreruta,pasajerosadultomayor,pasajerosregulares,pasajerostotales
0,26,2021,1,"AUTOBUSES ROMERO, S.A.",334,CARTAGO-CABALLO BLANCO-DULCE NOMBRE-BLANQUILLO...,2319,19605,21924
1,27,2021,1,"AUTOBUSES ROMERO, S.A.",334,CARTAGO-CABALLO BLANCO-DULCE NOMBRE-BLANQUILLO...,259,3520,3779
2,123,2021,1,"AUTOTRANSPORTES EL GUARCO, S.A.",328,CARTAGO – TEJAR – SAN ISIDRO – HIGUITO – PARQU...,121,2416,2537
3,124,2021,1,"AUTOTRANSPORTES EL GUARCO, S.A.",328,CARTAGO – TEJAR – SAN ISIDRO – HIGUITO – PARQU...,748,4687,5435
4,125,2021,1,"AUTOTRANSPORTES EL GUARCO, S.A.",328,CARTAGO – TEJAR – SAN ISIDRO – HIGUITO – PARQU...,3973,38293,42266
...,...,...,...,...,...,...,...,...,...
4110,41419,2023,12,"TRANSPORTES UNIDOS SAN NICOLAS TRAUSANIC, S. A.",323,CARTAGO-TARAS-SAN NICOLAS-LA LIMA-OCHOMOGO,2251,20688,22939
4111,41420,2023,12,"TRANSPORTES UNIDOS SAN NICOLAS TRAUSANIC, S. A.",323,CARTAGO-TARAS-SAN NICOLAS-LA LIMA-OCHOMOGO,4274,41767,46041
4112,41421,2023,12,"TRANSPORTES UNIDOS SAN NICOLAS TRAUSANIC, S. A.",323,CARTAGO-TARAS-SAN NICOLAS-LA LIMA-OCHOMOGO,4488,42070,46558
4113,41435,2023,12,"VIDAL ENRIQUE Y MINOR, S.A.(VEMSA)",366,CARTAGO-LLANO GRANDE,358,2390,2748
4114,41436,2023,12,"VIDAL ENRIQUE Y MINOR, S.A.(VEMSA)",366,CARTAGO-LLANO GRANDE,743,10359,11102

## Detectar top 5 meses con menor demanda de pasajeros en Cartago

In [10]:
pd.read_sql_query("""
SELECT
    year,
    month,
    SUM(pasajerostotales) AS total_pasajeros
FROM pasajeros_cartago
GROUP BY year, month
ORDER BY total_pasajeros ASC
LIMIT 5;
""", conn)

   year  month  total_pasajeros
0  2021      5          1946738
1  2021      4          1978824
2  2021      2          1987866
3  2021      6          2053252
4  2021      1          2070527

## Cerrar conexión

In [11]:
conn.close()
print("Conexión cerrada.")

Conexión cerrada.